# Задача 30: Заполните массив элементами арифметической
# прогрессии. Её первый элемент, разность и количество
# элементов нужно ввести с клавиатуры. Формула для
# получения n-го члена прогрессии: 
# an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

# Ввод: 7 2 5
# Вывод: 7 9 11 13 15

start_mass = int(input())
razn_mass = int(input())
length_mass = int(input())
mass = [start_mass + i * razn_mass for i in range(length_mass)]
print(mass)